Model: "cifar10_cnn_model"
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
input_1 (InputLayer)            [(None, 32, 32, 3)]  0                                            
__________________________________________________________________________________________________
conv2d (Conv2D)                 (None, 26, 26, 32)   4736        input_1[0][0]                    
__________________________________________________________________________________________________
max_pooling2d (MaxPooling2D)    (None, 13, 13, 32)   0           conv2d[0][0]                     
__________________________________________________________________________________________________
batch_normalization (BatchNorma (None, 13, 13, 32)   128         max_pooling2d[0][0]              
__________________________________________________________________________________________________
conv2d_1 (Conv2D)               (None, 11, 11, 64)   18496       batch_normalization[0][0]        
__________________________________________________________________________________________________
dropout (Dropout)               (None, 11, 11, 64)   0           conv2d_1[0][0]                   
__________________________________________________________________________________________________
batch_normalization_1 (BatchNor (None, 11, 11, 64)   256         dropout[0][0]                    
__________________________________________________________________________________________________
conv2d_6 (Conv2D)               (None, 11, 11, 8)    520         batch_normalization_1[0][0]      
__________________________________________________________________________________________________
conv2d_7 (Conv2D)               (None, 11, 11, 16)   400         conv2d_6[0][0]                   
__________________________________________________________________________________________________
conv2d_3 (Conv2D)               (None, 11, 11, 48)   3120        batch_normalization_1[0][0]      
__________________________________________________________________________________________________
conv2d_8 (Conv2D)               (None, 11, 11, 16)   784         conv2d_7[0][0]                   
__________________________________________________________________________________________________
conv2d_4 (Conv2D)               (None, 11, 11, 64)   9280        conv2d_3[0][0]                   
__________________________________________________________________________________________________
conv2d_9 (Conv2D)               (None, 11, 11, 16)   784         conv2d_8[0][0]                   
__________________________________________________________________________________________________
max_pooling2d_1 (MaxPooling2D)  (None, 11, 11, 64)   0           batch_normalization_1[0][0]      
__________________________________________________________________________________________________
conv2d_2 (Conv2D)               (None, 11, 11, 32)   2080        batch_normalization_1[0][0]      
__________________________________________________________________________________________________
conv2d_5 (Conv2D)               (None, 11, 11, 64)   12352       conv2d_4[0][0]                   
__________________________________________________________________________________________________
conv2d_10 (Conv2D)              (None, 11, 11, 16)   784         conv2d_9[0][0]                   
__________________________________________________________________________________________________
conv2d_11 (Conv2D)              (None, 11, 11, 16)   1040        max_pooling2d_1[0][0]            
__________________________________________________________________________________________________
concatenate (Concatenate)       (None, 11, 11, 128)  0           conv2d_2[0][0]                   
                                                                 conv2d_5[0][0]                   
                                                                 conv2d_10[0][0]                  
                                                                 conv2d_11[0][0]                  
__________________________________________________________________________________________________
global_average_pooling2d (Globa (None, 128)          0           concatenate[0][0]                
__________________________________________________________________________________________________
dropout_1 (Dropout)             (None, 128)          0           global_average_pooling2d[0][0]   
__________________________________________________________________________________________________
dense (Dense)                   (None, 32)           4128        dropout_1[0][0]                  
__________________________________________________________________________________________________
dense_1 (Dense)                 (None, 10)           330         dense[0][0]                      
==================================================================================================
Total params: 59,218
Trainable params: 59,026
Non-trainable params: 192
__________________________________________________________________________________________________